"""Константы для текстовых сообщений пользователям"""


class UserTrackingDialogs:
    """Сообщения для функционала отслеживания пользователей"""

    USER_NOT_FOUND = "❌ Пользователь {identificator} не найден."
    USER_ALREADY_TRACKED = (
        "❌ Пользователь @{user_username} уже добавлен в отслеживание."
    )
    SUCCESS_ADD_USER_TO_TRACKING = (
        "✅ Отлично! Теперь Вы сможете собирать статистику по этому пользователю:\n\n"
        "😀 Юзер: @{user_username}\n"
        "🆔 ID: {user_tgid}\n"
        "👤 Добавил: @{admin_username}"
    )
    ERROR_ADD_USER_TO_TRACKING = "❌ Ошибка при добавлении пользователя в отслеживание."
