"""Константы для текстовых сообщений пользователям"""


class UserTrackingDialogs:
    """Сообщения для функционала отслеживания пользователей"""

    USER_NOT_FOUND = "❌ Пользователь {identificator} не найден."
    USER_ALREADY_TRACKED = (
        "❌ Пользователь @{user_username} уже добавлен в отслеживание."
    )
    SUCCESS_ADD_USER_TO_TRACKING = (
        "✅ Отлично! Теперь Вы сможете собирать статистику по этому пользователю:\n\n"
        "😀 Юзер: @{user_username}\n"
        "🆔 ID: {user_tgid}\n"
        "👤 Добавил: @{admin_username}"
    )
    ERROR_ADD_USER_TO_TRACKING = "❌ Ошибка при добавлении пользователя в отслеживание."


class BanUserDialogs:
    """Сообщения для функционала бана пользователей"""

    INPUT_USER_DATA = (
        "🔒 <b>Блокировка пользователя</b>\n\n"
        "Чтобы заблокировать пользователя пришлите @username или Telegram ID пользователя\n\n"
        "<i>Пример: @john_pidor или <code>123456789</code></i>"
    )
    INPUT_REASON = "Пожалуйста, укажите причину блокировки пользователя."
    SELECT_CHAT = "Выберите чат, в котором хотите произвести блокировку @{username}."
    USER_NOT_FOUND = "❌ Пользователь {identificator} не найден."
    USER_ALREADY_BANNED = "❌ Пользователь @{user_username} уже заблокирован."
    SUCCESS_BAN_USER = (
        "✅ Отлично! Теперь пользователь @{user_username} заблокирован.\n\n"
        "👤 Добавил: @{admin_username}"
    )
    ERROR_BAN_USER = "❌ Ошибка при блокировке пользователя."
    NO_CHATS = "❌ Не удалось найти чаты."
