import enum


class PunishmentText(str, enum.Enum):
    WARNING = (
        "🚫 @{username}, к сожалению ты нарушил (-ла) правила чата. "
        "Пожалуйста, больше не нарушай, чтобы не получить ограничение 🙂"
    )
    MUTE = (
        "🚫 @{username}, к сожалению, ты снова нарушил (-ла) правила чата. "
        "Ранее тебя уже предупреждали, поэтому в этот раз ты получаешь ограничение на {period} 😔"
    )
    BAN = (
        "🚫 @{username}, ты часто нарушал (-ла) правила чата, поэтому мы "
        "вынуждены выли закрыть для тебя доступ. Захочешь вернуться - обсуди это с "
        "модераторами и/или администраторами."
    )


class PunishmentActions(str, enum.Enum):
    WARNING = "warning"
    BAN = "ban"


class PunishmentType(str, enum.Enum):
    WARNING = "warning"
    MUTE = "mute"
    BAN = "ban"
