import logging

from openrouter import OpenRouter

from constants.enums import SummaryType

from .ai_service_base import IAIService

logger = logging.getLogger(__name__)

SYSTEM_CONTENT = (
    "Ты — эксперт-аналитик коммуникаций. Твоя задача — проанализировать лог чата и выдать глубокую аналитику. "
    "ВАЖНО: Не исользуй HTML-разметку Telegram (<b>, <i>, <code>), а только текст."
    "ПРАВИЛА ОФОРМЛЕНИЯ:\n"
    "- При упоминании пользователей всегда добавляй символ '@' перед их username (например, @username).\n"
    "- Будь лаконичен: фокусируйся на качестве выводов, а не на объеме текста.\n"
    "- В анализе обязательно учитывай список отслеживаемых пользователей: {tracked_users_list}."
    "- Если в списке отслеживаемых пользователей есть пользователь, который не упоминается в логе сообщений, то не упоминай его в анализе."
)
USER_CONTENT_SHORT = (
    "Проведи экспресс-анализ диалога. В начале ответа добавь заголовок: "
    "'📊 Аналитическая выжимка ({msg_count} сообщ.)'\n\n"
    "Сфокусируйся на следующих пунктах:\n"
    "🌡 Атмосфера: [тезисно об общем настроении в чате]\n"
    "🔍 Суть: [топ-1 тема для обсуждения]\n"
    "🤩 Ключевое событие: [ключевое событие, которое все обсуждали]\n"
    "🧐 Участие отсл. пользователей: [общее направление ответов отслеживаемых пользователей: {tracked_users_list}]\n\n"
    "Лог сообщений для анализа:\n{text}"
)

USER_CONTENT_FULL = (
    "Проведи глубокий аналитический разбор диалога. В начале ответа добавь заголовок: "
    "'📈 Глубокий анализ обсуждения ({msg_count} сообщ.)'\n\n"
    "Структурируй отчет по следующим категориям:\n"
    "🌡 Атмосфера и тон: [анализ общего настроения в чате]\n"
    "🔍 Суть: [топ-5 тем для обсуждения]\n"
    "🤩 Ключевые события: [топ-3 событий, которые все обсуждали]\n"
    "🤨 Участники: [топ-5 частников и их характеристика]\n"
    "❌ Риски и конфликты: [топ-5 конфликтных ситуаций между участниками и риски для компании]\n"
    "🧐 <b>Участие отсл. пользователей:</b> [общее направление ответов отслеживаемых пользователей: {tracked_users_list}]\n\n"
    "ПРАВИЛА ОФОРМЛЕНИЯ:\n"
    "- Используй буллиты (•) для списков.\n"
    "- Не используй вложенные списки более чем одного уровня.\n"
    "Лог сообщений для анализа:\n{text}"
)


class OpenRouterService(IAIService):
    def __init__(self, api_key: str, model_name: str) -> None:
        super().__init__(model_name)
        self._api_key = api_key

    async def summarize_text(
        self,
        text: str,
        msg_count: int,
        summary_type: SummaryType,
        tracked_users: list[str],
    ) -> str:
        async with OpenRouter(api_key=self._api_key) as client:
            try:
                user_content = (
                    USER_CONTENT_SHORT
                    if summary_type == SummaryType.SHORT
                    else USER_CONTENT_FULL
                )
                tracked_users_str = (
                    ", ".join(tracked_users) if tracked_users else "отсутствуют"
                )
                response = await client.chat.send_async(
                    model=self._model_name,
                    messages=[
                        {
                            "role": "system",
                            "content": SYSTEM_CONTENT.format(
                                tracked_users_list=tracked_users_str
                            ),
                        },
                        {
                            "role": "user",
                            "content": user_content.format(
                                text=text,
                                msg_count=msg_count,
                                tracked_users_list=tracked_users_str,
                            ),
                        },
                    ],
                )

                return response.choices[0].message.content
            except Exception as e:
                logger.error("Unexpected AI error: %s", e, exc_info=True)
                return "❌ Произошла непредвиденная ошибка при генерации сводки."
